magnus_3d/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    (2.000000 0.000000 0.000000)  // 0 E0z0
    (0.000000 2.000000 0.000000)  // 1 N0z0
    (-2.000000 0.000000 0.000000)  // 2 W0z0
    (0.000000 -2.000000 0.000000)  // 3 S0z0
    (5.000000 0.000000 0.000000)  // 4 E1z0
    (0.000000 5.000000 0.000000)  // 5 N1z0
    (-5.000000 0.000000 0.000000)  // 6 W1z0
    (0.000000 -5.000000 0.000000)  // 7 S1z0
    (80.000000 0.000000 0.000000)  // 8 E2z0
    (0.000000 40.000000 0.000000)  // 9 N2z0
    (-40.000000 0.000000 0.000000)  // 10 W2z0
    (0.000000 -40.000000 0.000000)  // 11 S2z0
    (-40.000000 -40.000000 0.000000)  // 12 SWz0
    (80.000000 -40.000000 0.000000)  // 13 SEz0
    (80.000000 40.000000 0.000000)  // 14 NEz0
    (-40.000000 40.000000 0.000000)  // 15 NWz0
    (1.414214 1.414214 0.000000)  // 16 NE0z0
    (-1.414214 1.414214 0.000000)  // 17 NW0z0
    (-1.414214 -1.414214 0.000000)  // 18 SW0z0
    (1.414214 -1.414214 0.000000)  // 19 SE0z0
    (3.535534 3.535534 0.000000)  // 20 NE1z0
    (-3.535534 3.535534 0.000000)  // 21 NW1z0
    (-3.535534 -3.535534 0.000000)  // 22 SW1z0
    (3.535534 -3.535534 0.000000)  // 23 SE1z0
    (40.000000 40.000000 0.000000)  // 24 N2Ez0
    (-20.000000 40.000000 0.000000)  // 25 N2Wz0
    (80.000000 20.000000 0.000000)  // 26 E2Nz0
    (80.000000 -20.000000 0.000000)  // 27 E2Sz0
    (40.000000 -40.000000 0.000000)  // 28 S2Ez0
    (-20.000000 -40.000000 0.000000)  // 29 S2Wz0
    (-40.000000 20.000000 0.000000)  // 30 W2Nz0
    (-40.000000 -20.000000 0.000000)  // 31 W2Sz0
    (2.000000 0.000000 32.000000)  // 32 Ez32
    (0.000000 2.000000 32.000000)  // 33 Nz32
    (-2.000000 0.000000 32.000000)  // 34 Wz32
    (0.000000 -2.000000 32.000000)  // 35 Sz32
    (5.000000 0.000000 32.000000)  // 36 E1z32
    (0.000000 5.000000 32.000000)  // 37 N1z32
    (-5.000000 0.000000 32.000000)  // 38 W1z32
    (0.000000 -5.000000 32.000000)  // 39 S1z32
    (80.000000 0.000000 32.000000)  // 40 E2z32
    (0.000000 40.000000 32.000000)  // 41 N2z32
    (-40.000000 0.000000 32.000000)  // 42 W2z32
    (0.000000 -40.000000 32.000000)  // 43 S2z32
    (-40.000000 -40.000000 32.000000)  // 44 SWz32
    (80.000000 -40.000000 32.000000)  // 45 SEz32
    (80.000000 40.000000 32.000000)  // 46 NEz32
    (-40.000000 40.000000 32.000000)  // 47 NWz32
    (1.414214 1.414214 32.000000)  // 48 NEz32
    (-1.414214 1.414214 32.000000)  // 49 NWz32
    (-1.414214 -1.414214 32.000000)  // 50 SWz32
    (1.414214 -1.414214 32.000000)  // 51 SEz32
    (3.535534 3.535534 32.000000)  // 52 NE1z32
    (-3.535534 3.535534 32.000000)  // 53 NW1z32
    (-3.535534 -3.535534 32.000000)  // 54 SW1z32
    (3.535534 -3.535534 32.000000)  // 55 SE1z32
    (40.000000 40.000000 32.000000)  // 56 N2Ez32
    (-20.000000 40.000000 32.000000)  // 57 N2Wz32
    (80.000000 20.000000 32.000000)  // 58 E2Nz32
    (80.000000 -20.000000 32.000000)  // 59 E2Sz32
    (40.000000 -40.000000 32.000000)  // 60 S2Ez32
    (-20.000000 -40.000000 32.000000)  // 61 S2Wz32
    (-40.000000 20.000000 32.000000)  // 62 W2Nz32
    (-40.000000 -20.000000 32.000000)  // 63 W2Sz32
    (2.000000 0.000000 52.000000)  // 64 Ez52
    (0.000000 2.000000 52.000000)  // 65 Nz52
    (-2.000000 0.000000 52.000000)  // 66 Wz52
    (0.000000 -2.000000 52.000000)  // 67 Sz52
    (5.000000 0.000000 52.000000)  // 68 E1z52
    (0.000000 5.000000 52.000000)  // 69 N1z52
    (-5.000000 0.000000 52.000000)  // 70 W1z52
    (0.000000 -5.000000 52.000000)  // 71 S1z52
    (80.000000 0.000000 52.000000)  // 72 E2z52
    (0.000000 40.000000 52.000000)  // 73 N2z52
    (-40.000000 0.000000 52.000000)  // 74 W2z52
    (0.000000 -40.000000 52.000000)  // 75 S2z52
    (-40.000000 -40.000000 52.000000)  // 76 SWz52
    (80.000000 -40.000000 52.000000)  // 77 SEz52
    (80.000000 40.000000 52.000000)  // 78 NEz52
    (-40.000000 40.000000 52.000000)  // 79 NWz52
    (1.414214 1.414214 52.000000)  // 80 NEz52
    (-1.414214 1.414214 52.000000)  // 81 NWz52
    (-1.414214 -1.414214 52.000000)  // 82 SWz52
    (1.414214 -1.414214 52.000000)  // 83 SEz52
    (3.535534 3.535534 52.000000)  // 84 NE1z52
    (-3.535534 3.535534 52.000000)  // 85 NW1z52
    (-3.535534 -3.535534 52.000000)  // 86 SW1z52
    (3.535534 -3.535534 52.000000)  // 87 SE1z52
    (40.000000 40.000000 52.000000)  // 88 N2Ez52
    (-20.000000 40.000000 52.000000)  // 89 N2Wz52
    (80.000000 20.000000 52.000000)  // 90 E2Nz52
    (80.000000 -20.000000 52.000000)  // 91 E2Sz52
    (40.000000 -40.000000 52.000000)  // 92 S2Ez52
    (-20.000000 -40.000000 52.000000)  // 93 S2Wz52
    (-40.000000 20.000000 52.000000)  // 94 W2Nz52
    (-40.000000 -20.000000 52.000000)  // 95 W2Sz52
);

blocks
(
    hex (0 4 20 16 32 36 52 48) (50 15 50) simpleGrading (5 1 0.1)
    hex (32 36 52 48 64 68 84 80) (50 15 20) simpleGrading (5 1 1.0)
    hex (16 20 5 1 48 52 37 33) (50 15 50) simpleGrading (5 1 0.1)
    hex (48 52 37 33 80 84 69 65) (50 15 20) simpleGrading (5 1 1.0)
    hex (1 5 21 17 33 37 53 49) (50 15 50) simpleGrading (5 1 0.1)
    hex (33 37 53 49 65 69 85 81) (50 15 20) simpleGrading (5 1 1.0)
    hex (17 21 6 2 49 53 38 34) (50 15 50) simpleGrading (5 1 0.1)
    hex (49 53 38 34 81 85 70 66) (50 15 20) simpleGrading (5 1 1.0)
    hex (2 6 22 18 34 38 54 50) (50 15 50) simpleGrading (5 1 0.1)
    hex (34 38 54 50 66 70 86 82) (50 15 20) simpleGrading (5 1 1.0)
    hex (18 22 7 3 50 54 39 35) (50 15 50) simpleGrading (5 1 0.1)
    hex (50 54 39 35 82 86 71 67) (50 15 20) simpleGrading (5 1 1.0)
    hex (3 7 23 19 35 39 55 51) (50 15 50) simpleGrading (5 1 0.1)
    hex (35 39 55 51 67 71 87 83) (50 15 20) simpleGrading (5 1 1.0)
    hex (19 23 4 0 51 55 36 32) (50 15 50) simpleGrading (5 1 0.1)
    hex (51 55 36 32 83 87 68 64) (50 15 20) simpleGrading (5 1 1.0)
    hex (4 8 26 20 36 40 58 52) (40 15 50) simpleGrading (1 1 0.1)
    hex (36 40 58 52 68 72 90 84) (40 15 20) simpleGrading (1 1 1.0)
    hex (20 24 9 5 52 56 41 37) (40 15 50) simpleGrading (1 1 0.1)
    hex (52 56 41 37 84 88 73 69) (40 15 20) simpleGrading (1 1 1.0)
    hex (5 9 25 21 37 41 57 53) (40 15 50) simpleGrading (1 1 0.1)
    hex (37 41 57 53 69 73 89 85) (40 15 20) simpleGrading (1 1 1.0)
    hex (21 30 10 6 53 62 42 38) (40 15 50) simpleGrading (1 1 0.1)
    hex (53 62 42 38 85 94 74 70) (40 15 20) simpleGrading (1 1 1.0)
    hex (6 10 31 22 38 42 63 54) (40 15 50) simpleGrading (1 1 0.1)
    hex (38 42 63 54 70 74 95 86) (40 15 20) simpleGrading (1 1 1.0)
    hex (22 29 11 7 54 61 43 39) (40 15 50) simpleGrading (1 1 0.1)
    hex (54 61 43 39 86 93 75 71) (40 15 20) simpleGrading (1 1 1.0)
    hex (7 11 28 23 39 43 60 55) (40 15 50) simpleGrading (1 1 0.1)
    hex (39 43 60 55 71 75 92 87) (40 15 20) simpleGrading (1 1 1.0)
    hex (23 27 8 4 55 59 40 36) (40 15 50) simpleGrading (1 1 0.1)
    hex (55 59 40 36 87 91 72 68) (40 15 20) simpleGrading (1 1 1.0)
    hex (20 26 14 24 52 58 46 56) (40 40 50) simpleGrading (1 1 0.1)
    hex (52 58 46 56 84 90 78 88) (40 40 20) simpleGrading (1 1 1.0)
    hex (25 15 30 21 57 47 62 53) (40 40 50) simpleGrading (1 1 0.1)
    hex (57 47 62 53 89 79 94 85) (40 40 20) simpleGrading (1 1 1.0)
    hex (31 12 29 22 63 44 61 54) (40 40 50) simpleGrading (1 1 0.1)
    hex (63 44 61 54 95 76 93 86) (40 40 20) simpleGrading (1 1 1.0)
    hex (28 13 27 23 60 45 59 55) (40 40 50) simpleGrading (1 1 0.1)
    hex (60 45 59 55 92 77 91 87) (40 40 20) simpleGrading (1 1 1.0)
);

edges
(
    arc 0 16 (1.847759 0.765367 0.0)
    arc 16 1 (0.765367 1.847759 0.0)
    arc 1 17 (-0.765367 1.847759 0.0)
    arc 17 2 (-1.847759 0.765367 0.0)
    arc 2 18 (-1.847759 -0.765367 0.0)
    arc 18 3 (-0.765367 -1.847759 0.0)
    arc 3 19 (0.765367 -1.847759 0.0)
    arc 19 0 (1.847759 -0.765367 0.0)
    arc 4 20 (4.619398 1.913417 0.0)
    arc 20 5 (1.913417 4.619398 0.0)
    arc 5 21 (-1.913417 4.619398 0.0)
    arc 21 6 (-4.619398 1.913417 0.0)
    arc 6 22 (-4.619398 -1.913417 0.0)
    arc 22 7 (-1.913417 -4.619398 0.0)
    arc 7 23 (1.913417 -4.619398 0.0)
    arc 23 4 (4.619398 -1.913417 0.0)
    arc 32 48 (1.847759 0.765367 32.0)
    arc 48 33 (0.765367 1.847759 32.0)
    arc 33 49 (-0.765367 1.847759 32.0)
    arc 49 34 (-1.847759 0.765367 32.0)
    arc 34 50 (-1.847759 -0.765367 32.0)
    arc 50 35 (-0.765367 -1.847759 32.0)
    arc 35 51 (0.765367 -1.847759 32.0)
    arc 51 32 (1.847759 -0.765367 32.0)
    arc 36 52 (4.619398 1.913417 32.0)
    arc 52 37 (1.913417 4.619398 32.0)
    arc 37 53 (-1.913417 4.619398 32.0)
    arc 53 38 (-4.619398 1.913417 32.0)
    arc 38 54 (-4.619398 -1.913417 32.0)
    arc 54 39 (-1.913417 -4.619398 32.0)
    arc 39 55 (1.913417 -4.619398 32.0)
    arc 55 36 (4.619398 -1.913417 32.0)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (30 10 42 62)
            (62 42 74 94)
            (10 31 63 42)
            (42 63 95 74)
            (15 30 62 47)
            (47 62 94 79)
            (31 12 44 63)
            (63 44 76 95)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 26 58 40)
            (40 58 90 72)
            (27 8 40 59)
            (59 40 72 91)
            (26 14 46 58)
            (58 46 78 90)
            (13 27 59 45)
            (45 59 91 77)
        );
    }
    top
    {
        type symmetry;
        faces
        (
            (24 9 41 56)
            (56 41 73 88)
            (9 25 57 41)
            (41 57 89 73)
            (14 24 56 46)
            (46 56 88 78)
            (25 15 47 57)
            (57 47 79 89)
        );
    }
    bottom
    {
        type symmetry;
        faces
        (
            (29 11 43 61)
            (61 43 75 93)
            (11 28 60 43)
            (43 60 92 75)
            (12 29 61 44)
            (44 61 93 76)
            (28 13 45 60)
            (60 45 77 92)
        );
    }
    cylinder
    {
        type wall;
        faces
        (
            (0 32 48 16)
            (16 48 33 1)
            (1 33 49 17)
            (17 49 34 2)
            (2 34 50 18)
            (18 50 35 3)
            (3 35 51 19)
            (19 51 32 0)
        );
    }
    midSpan
    {
        type symmetry;
        faces
        (
            (0 16 20 4)
            (16 1 5 20)
            (1 17 21 5)
            (17 2 6 21)
            (2 18 22 6)
            (18 3 7 22)
            (3 19 23 7)
            (19 0 4 23)
            (4 20 26 8)
            (20 5 9 24)
            (5 21 25 9)
            (21 6 10 30)
            (6 22 31 10)
            (22 7 11 29)
            (7 23 28 11)
            (23 4 8 27)
            (20 24 14 26)
            (25 21 30 15)
            (31 22 29 12)
            (28 23 27 13)
        );
    }
    farField
    {
        type patch;
        faces
        (
            (64 68 84 80)
            (80 84 69 65)
            (65 69 85 81)
            (81 85 70 66)
            (66 70 86 82)
            (82 86 71 67)
            (67 71 87 83)
            (83 87 68 64)
            (68 72 90 84)
            (84 88 73 69)
            (69 73 89 85)
            (85 94 74 70)
            (70 74 95 86)
            (86 93 75 71)
            (71 75 92 87)
            (87 91 72 68)
            (84 90 78 88)
            (89 79 94 85)
            (95 76 93 86)
            (92 77 91 87)
        );
    }
    undefined
    {
        type patch;
        faces
        (
            (32 64 80 48)
            (48 80 65 33)
            (33 65 81 49)
            (49 81 66 34)
            (34 66 82 50)
            (50 82 67 35)
            (35 67 83 51)
            (51 83 64 32)
        );
    }
);
